#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Wed May  5 19:19:17 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 60 -waveform {0 30} -name vsysclk 
group_path -name I2R -from [list [get_ports reset] [get_ports enable] [get_ports clk] [get_ports {Arr9[0]}] [get_ports {Arr9[1]}] [get_ports {Arr9[2]}] [get_ports {Arr9[3]}] [get_ports {Arr9[4]}] [get_ports {Arr9[5]}] [get_ports {Arr9[6]}] [get_ports {Arr9[7]}] [get_ports {Arr9[8]}] [get_ports {Arr9[9]}] [get_ports {Arr9[10]}] [get_ports {Arr9[11]}] [get_ports {Arr9[12]}] [get_ports {Arr9[13]}] [get_ports {Arr9[14]}] [get_ports {Arr9[15]}] [get_ports {Arr8[0]}] [get_ports {Arr8[1]}] [get_ports {Arr8[2]}] [get_ports {Arr8[3]}] [get_ports {Arr8[4]}] [get_ports {Arr8[5]}] [get_ports {Arr8[6]}] [get_ports {Arr8[7]}] [get_ports {Arr8[8]}] [get_ports {Arr8[9]}] [get_ports {Arr8[10]}] [get_ports {Arr8[11]}] [get_ports {Arr8[12]}] [get_ports {Arr8[13]}] [get_ports {Arr8[14]}] [get_ports {Arr8[15]}] [get_ports {Arr7[0]}] [get_ports {Arr7[1]}] [get_ports {Arr7[2]}] [get_ports {Arr7[3]}] [get_ports {Arr7[4]}] [get_ports {Arr7[5]}] [get_ports {Arr7[6]}] [get_ports {Arr7[7]}] [get_ports {Arr7[8]}] [get_ports {Arr7[9]}] [get_ports {Arr7[10]}] [get_ports {Arr7[11]}] [get_ports {Arr7[12]}] [get_ports {Arr7[13]}] [get_ports {Arr7[14]}] [get_ports {Arr7[15]}] [get_ports {Arr6[0]}] [get_ports {Arr6[1]}] [get_ports {Arr6[2]}] [get_ports {Arr6[3]}] [get_ports {Arr6[4]}] [get_ports {Arr6[5]}] [get_ports {Arr6[6]}] [get_ports {Arr6[7]}] [get_ports {Arr6[8]}] [get_ports {Arr6[9]}] [get_ports {Arr6[10]}] [get_ports {Arr6[11]}] [get_ports {Arr6[12]}] [get_ports {Arr6[13]}] [get_ports {Arr6[14]}] [get_ports {Arr6[15]}] [get_ports {Arr5[0]}] [get_ports {Arr5[1]}] [get_ports {Arr5[2]}] [get_ports {Arr5[3]}] [get_ports {Arr5[4]}] [get_ports {Arr5[5]}] [get_ports {Arr5[6]}] [get_ports {Arr5[7]}] [get_ports {Arr5[8]}] [get_ports {Arr5[9]}] [get_ports {Arr5[10]}] [get_ports {Arr5[11]}] [get_ports {Arr5[12]}] [get_ports {Arr5[13]}] [get_ports {Arr5[14]}] [get_ports {Arr5[15]}] [get_ports {Arr4[0]}] [get_ports {Arr4[1]}] [get_ports {Arr4[2]}] [get_ports {Arr4[3]}] [get_ports {Arr4[4]}] [get_ports {Arr4[5]}] [get_ports {Arr4[6]}] [get_ports {Arr4[7]}] [get_ports {Arr4[8]}] [get_ports {Arr4[9]}] [get_ports {Arr4[10]}] [get_ports {Arr4[11]}] [get_ports {Arr4[12]}] [get_ports {Arr4[13]}] [get_ports {Arr4[14]}] [get_ports {Arr4[15]}] [get_ports {Arr3[0]}] [get_ports {Arr3[1]}] [get_ports {Arr3[2]}] [get_ports {Arr3[3]}] [get_ports {Arr3[4]}] [get_ports {Arr3[5]}] [get_ports {Arr3[6]}] [get_ports {Arr3[7]}] [get_ports {Arr3[8]}] [get_ports {Arr3[9]}] [get_ports {Arr3[10]}] [get_ports {Arr3[11]}] [get_ports {Arr3[12]}] [get_ports {Arr3[13]}] [get_ports {Arr3[14]}] [get_ports {Arr3[15]}] [get_ports {Arr2[0]}] [get_ports {Arr2[1]}] [get_ports {Arr2[2]}] [get_ports {Arr2[3]}] [get_ports {Arr2[4]}] [get_ports {Arr2[5]}] [get_ports {Arr2[6]}] [get_ports {Arr2[7]}] [get_ports {Arr2[8]}] [get_ports {Arr2[9]}] [get_ports {Arr2[10]}] [get_ports {Arr2[11]}] [get_ports {Arr2[12]}] [get_ports {Arr2[13]}] [get_ports {Arr2[14]}] [get_ports {Arr2[15]}] [get_ports {Arr1[0]}] [get_ports {Arr1[1]}] [get_ports {Arr1[2]}] [get_ports {Arr1[3]}] [get_ports {Arr1[4]}] [get_ports {Arr1[5]}] [get_ports {Arr1[6]}] [get_ports {Arr1[7]}] [get_ports {Arr1[8]}] [get_ports {Arr1[9]}] [get_ports {Arr1[10]}] [get_ports {Arr1[11]}] [get_ports {Arr1[12]}] [get_ports {Arr1[13]}] [get_ports {Arr1[14]}] [get_ports {Arr1[15]}] [get_ports {Arr0[0]}] [get_ports {Arr0[1]}] [get_ports {Arr0[2]}] [get_ports {Arr0[3]}] [get_ports {Arr0[4]}] [get_ports {Arr0[5]}] [get_ports {Arr0[6]}] [get_ports {Arr0[7]}] [get_ports {Arr0[8]}] [get_ports {Arr0[9]}] [get_ports {Arr0[10]}] [get_ports {Arr0[11]}] [get_ports {Arr0[12]}] [get_ports {Arr0[13]}] [get_ports {Arr0[14]}] [get_ports {Arr0[15]}]]
group_path -name I2O -from [list [get_ports reset] [get_ports enable] [get_ports clk] [get_ports {Arr9[0]}] [get_ports {Arr9[1]}] [get_ports {Arr9[2]}] [get_ports {Arr9[3]}] [get_ports {Arr9[4]}] [get_ports {Arr9[5]}] [get_ports {Arr9[6]}] [get_ports {Arr9[7]}] [get_ports {Arr9[8]}] [get_ports {Arr9[9]}] [get_ports {Arr9[10]}] [get_ports {Arr9[11]}] [get_ports {Arr9[12]}] [get_ports {Arr9[13]}] [get_ports {Arr9[14]}] [get_ports {Arr9[15]}] [get_ports {Arr8[0]}] [get_ports {Arr8[1]}] [get_ports {Arr8[2]}] [get_ports {Arr8[3]}] [get_ports {Arr8[4]}] [get_ports {Arr8[5]}] [get_ports {Arr8[6]}] [get_ports {Arr8[7]}] [get_ports {Arr8[8]}] [get_ports {Arr8[9]}] [get_ports {Arr8[10]}] [get_ports {Arr8[11]}] [get_ports {Arr8[12]}] [get_ports {Arr8[13]}] [get_ports {Arr8[14]}] [get_ports {Arr8[15]}] [get_ports {Arr7[0]}] [get_ports {Arr7[1]}] [get_ports {Arr7[2]}] [get_ports {Arr7[3]}] [get_ports {Arr7[4]}] [get_ports {Arr7[5]}] [get_ports {Arr7[6]}] [get_ports {Arr7[7]}] [get_ports {Arr7[8]}] [get_ports {Arr7[9]}] [get_ports {Arr7[10]}] [get_ports {Arr7[11]}] [get_ports {Arr7[12]}] [get_ports {Arr7[13]}] [get_ports {Arr7[14]}] [get_ports {Arr7[15]}] [get_ports {Arr6[0]}] [get_ports {Arr6[1]}] [get_ports {Arr6[2]}] [get_ports {Arr6[3]}] [get_ports {Arr6[4]}] [get_ports {Arr6[5]}] [get_ports {Arr6[6]}] [get_ports {Arr6[7]}] [get_ports {Arr6[8]}] [get_ports {Arr6[9]}] [get_ports {Arr6[10]}] [get_ports {Arr6[11]}] [get_ports {Arr6[12]}] [get_ports {Arr6[13]}] [get_ports {Arr6[14]}] [get_ports {Arr6[15]}] [get_ports {Arr5[0]}] [get_ports {Arr5[1]}] [get_ports {Arr5[2]}] [get_ports {Arr5[3]}] [get_ports {Arr5[4]}] [get_ports {Arr5[5]}] [get_ports {Arr5[6]}] [get_ports {Arr5[7]}] [get_ports {Arr5[8]}] [get_ports {Arr5[9]}] [get_ports {Arr5[10]}] [get_ports {Arr5[11]}] [get_ports {Arr5[12]}] [get_ports {Arr5[13]}] [get_ports {Arr5[14]}] [get_ports {Arr5[15]}] [get_ports {Arr4[0]}] [get_ports {Arr4[1]}] [get_ports {Arr4[2]}] [get_ports {Arr4[3]}] [get_ports {Arr4[4]}] [get_ports {Arr4[5]}] [get_ports {Arr4[6]}] [get_ports {Arr4[7]}] [get_ports {Arr4[8]}] [get_ports {Arr4[9]}] [get_ports {Arr4[10]}] [get_ports {Arr4[11]}] [get_ports {Arr4[12]}] [get_ports {Arr4[13]}] [get_ports {Arr4[14]}] [get_ports {Arr4[15]}] [get_ports {Arr3[0]}] [get_ports {Arr3[1]}] [get_ports {Arr3[2]}] [get_ports {Arr3[3]}] [get_ports {Arr3[4]}] [get_ports {Arr3[5]}] [get_ports {Arr3[6]}] [get_ports {Arr3[7]}] [get_ports {Arr3[8]}] [get_ports {Arr3[9]}] [get_ports {Arr3[10]}] [get_ports {Arr3[11]}] [get_ports {Arr3[12]}] [get_ports {Arr3[13]}] [get_ports {Arr3[14]}] [get_ports {Arr3[15]}] [get_ports {Arr2[0]}] [get_ports {Arr2[1]}] [get_ports {Arr2[2]}] [get_ports {Arr2[3]}] [get_ports {Arr2[4]}] [get_ports {Arr2[5]}] [get_ports {Arr2[6]}] [get_ports {Arr2[7]}] [get_ports {Arr2[8]}] [get_ports {Arr2[9]}] [get_ports {Arr2[10]}] [get_ports {Arr2[11]}] [get_ports {Arr2[12]}] [get_ports {Arr2[13]}] [get_ports {Arr2[14]}] [get_ports {Arr2[15]}] [get_ports {Arr1[0]}] [get_ports {Arr1[1]}] [get_ports {Arr1[2]}] [get_ports {Arr1[3]}] [get_ports {Arr1[4]}] [get_ports {Arr1[5]}] [get_ports {Arr1[6]}] [get_ports {Arr1[7]}] [get_ports {Arr1[8]}] [get_ports {Arr1[9]}] [get_ports {Arr1[10]}] [get_ports {Arr1[11]}] [get_ports {Arr1[12]}] [get_ports {Arr1[13]}] [get_ports {Arr1[14]}] [get_ports {Arr1[15]}] [get_ports {Arr0[0]}] [get_ports {Arr0[1]}] [get_ports {Arr0[2]}] [get_ports {Arr0[3]}] [get_ports {Arr0[4]}] [get_ports {Arr0[5]}] [get_ports {Arr0[6]}] [get_ports {Arr0[7]}] [get_ports {Arr0[8]}] [get_ports {Arr0[9]}] [get_ports {Arr0[10]}] [get_ports {Arr0[11]}] [get_ports {Arr0[12]}] [get_ports {Arr0[13]}] [get_ports {Arr0[14]}] [get_ports {Arr0[15]}]]  -to [list [get_ports {result[0]}] [get_ports {result[1]}] [get_ports {result[2]}] [get_ports {result[3]}] [get_ports done]]
group_path -name R2O -to [list [get_ports {result[0]}] [get_ports {result[1]}] [get_ports {result[2]}] [get_ports {result[3]}] [get_ports done]]
set_load 10 [get_ports done]
set_load 10 [get_ports {result[3]}]
set_load 10 [get_ports {result[2]}]
set_load 10 [get_ports {result[1]}]
set_load 10 [get_ports {result[0]}]
set_input_transition 0.1 [get_ports {Arr0[15]}]
set_input_transition 0.1 [get_ports {Arr0[14]}]
set_input_transition 0.1 [get_ports {Arr0[13]}]
set_input_transition 0.1 [get_ports {Arr0[12]}]
set_input_transition 0.1 [get_ports {Arr0[11]}]
set_input_transition 0.1 [get_ports {Arr0[10]}]
set_input_transition 0.1 [get_ports {Arr0[9]}]
set_input_transition 0.1 [get_ports {Arr0[8]}]
set_input_transition 0.1 [get_ports {Arr0[7]}]
set_input_transition 0.1 [get_ports {Arr0[6]}]
set_input_transition 0.1 [get_ports {Arr0[5]}]
set_input_transition 0.1 [get_ports {Arr0[4]}]
set_input_transition 0.1 [get_ports {Arr0[3]}]
set_input_transition 0.1 [get_ports {Arr0[2]}]
set_input_transition 0.1 [get_ports {Arr0[1]}]
set_input_transition 0.1 [get_ports {Arr0[0]}]
set_input_transition 0.1 [get_ports {Arr1[15]}]
set_input_transition 0.1 [get_ports {Arr1[14]}]
set_input_transition 0.1 [get_ports {Arr1[13]}]
set_input_transition 0.1 [get_ports {Arr1[12]}]
set_input_transition 0.1 [get_ports {Arr1[11]}]
set_input_transition 0.1 [get_ports {Arr1[10]}]
set_input_transition 0.1 [get_ports {Arr1[9]}]
set_input_transition 0.1 [get_ports {Arr1[8]}]
set_input_transition 0.1 [get_ports {Arr1[7]}]
set_input_transition 0.1 [get_ports {Arr1[6]}]
set_input_transition 0.1 [get_ports {Arr1[5]}]
set_input_transition 0.1 [get_ports {Arr1[4]}]
set_input_transition 0.1 [get_ports {Arr1[3]}]
set_input_transition 0.1 [get_ports {Arr1[2]}]
set_input_transition 0.1 [get_ports {Arr1[1]}]
set_input_transition 0.1 [get_ports {Arr1[0]}]
set_input_transition 0.1 [get_ports {Arr2[15]}]
set_input_transition 0.1 [get_ports {Arr2[14]}]
set_input_transition 0.1 [get_ports {Arr2[13]}]
set_input_transition 0.1 [get_ports {Arr2[12]}]
set_input_transition 0.1 [get_ports {Arr2[11]}]
set_input_transition 0.1 [get_ports {Arr2[10]}]
set_input_transition 0.1 [get_ports {Arr2[9]}]
set_input_transition 0.1 [get_ports {Arr2[8]}]
set_input_transition 0.1 [get_ports {Arr2[7]}]
set_input_transition 0.1 [get_ports {Arr2[6]}]
set_input_transition 0.1 [get_ports {Arr2[5]}]
set_input_transition 0.1 [get_ports {Arr2[4]}]
set_input_transition 0.1 [get_ports {Arr2[3]}]
set_input_transition 0.1 [get_ports {Arr2[2]}]
set_input_transition 0.1 [get_ports {Arr2[1]}]
set_input_transition 0.1 [get_ports {Arr2[0]}]
set_input_transition 0.1 [get_ports {Arr3[15]}]
set_input_transition 0.1 [get_ports {Arr3[14]}]
set_input_transition 0.1 [get_ports {Arr3[13]}]
set_input_transition 0.1 [get_ports {Arr3[12]}]
set_input_transition 0.1 [get_ports {Arr3[11]}]
set_input_transition 0.1 [get_ports {Arr3[10]}]
set_input_transition 0.1 [get_ports {Arr3[9]}]
set_input_transition 0.1 [get_ports {Arr3[8]}]
set_input_transition 0.1 [get_ports {Arr3[7]}]
set_input_transition 0.1 [get_ports {Arr3[6]}]
set_input_transition 0.1 [get_ports {Arr3[5]}]
set_input_transition 0.1 [get_ports {Arr3[4]}]
set_input_transition 0.1 [get_ports {Arr3[3]}]
set_input_transition 0.1 [get_ports {Arr3[2]}]
set_input_transition 0.1 [get_ports {Arr3[1]}]
set_input_transition 0.1 [get_ports {Arr3[0]}]
set_input_transition 0.1 [get_ports {Arr4[15]}]
set_input_transition 0.1 [get_ports {Arr4[14]}]
set_input_transition 0.1 [get_ports {Arr4[13]}]
set_input_transition 0.1 [get_ports {Arr4[12]}]
set_input_transition 0.1 [get_ports {Arr4[11]}]
set_input_transition 0.1 [get_ports {Arr4[10]}]
set_input_transition 0.1 [get_ports {Arr4[9]}]
set_input_transition 0.1 [get_ports {Arr4[8]}]
set_input_transition 0.1 [get_ports {Arr4[7]}]
set_input_transition 0.1 [get_ports {Arr4[6]}]
set_input_transition 0.1 [get_ports {Arr4[5]}]
set_input_transition 0.1 [get_ports {Arr4[4]}]
set_input_transition 0.1 [get_ports {Arr4[3]}]
set_input_transition 0.1 [get_ports {Arr4[2]}]
set_input_transition 0.1 [get_ports {Arr4[1]}]
set_input_transition 0.1 [get_ports {Arr4[0]}]
set_input_transition 0.1 [get_ports {Arr5[15]}]
set_input_transition 0.1 [get_ports {Arr5[14]}]
set_input_transition 0.1 [get_ports {Arr5[13]}]
set_input_transition 0.1 [get_ports {Arr5[12]}]
set_input_transition 0.1 [get_ports {Arr5[11]}]
set_input_transition 0.1 [get_ports {Arr5[10]}]
set_input_transition 0.1 [get_ports {Arr5[9]}]
set_input_transition 0.1 [get_ports {Arr5[8]}]
set_input_transition 0.1 [get_ports {Arr5[7]}]
set_input_transition 0.1 [get_ports {Arr5[6]}]
set_input_transition 0.1 [get_ports {Arr5[5]}]
set_input_transition 0.1 [get_ports {Arr5[4]}]
set_input_transition 0.1 [get_ports {Arr5[3]}]
set_input_transition 0.1 [get_ports {Arr5[2]}]
set_input_transition 0.1 [get_ports {Arr5[1]}]
set_input_transition 0.1 [get_ports {Arr5[0]}]
set_input_transition 0.1 [get_ports {Arr6[15]}]
set_input_transition 0.1 [get_ports {Arr6[14]}]
set_input_transition 0.1 [get_ports {Arr6[13]}]
set_input_transition 0.1 [get_ports {Arr6[12]}]
set_input_transition 0.1 [get_ports {Arr6[11]}]
set_input_transition 0.1 [get_ports {Arr6[10]}]
set_input_transition 0.1 [get_ports {Arr6[9]}]
set_input_transition 0.1 [get_ports {Arr6[8]}]
set_input_transition 0.1 [get_ports {Arr6[7]}]
set_input_transition 0.1 [get_ports {Arr6[6]}]
set_input_transition 0.1 [get_ports {Arr6[5]}]
set_input_transition 0.1 [get_ports {Arr6[4]}]
set_input_transition 0.1 [get_ports {Arr6[3]}]
set_input_transition 0.1 [get_ports {Arr6[2]}]
set_input_transition 0.1 [get_ports {Arr6[1]}]
set_input_transition 0.1 [get_ports {Arr6[0]}]
set_input_transition 0.1 [get_ports {Arr7[15]}]
set_input_transition 0.1 [get_ports {Arr7[14]}]
set_input_transition 0.1 [get_ports {Arr7[13]}]
set_input_transition 0.1 [get_ports {Arr7[12]}]
set_input_transition 0.1 [get_ports {Arr7[11]}]
set_input_transition 0.1 [get_ports {Arr7[10]}]
set_input_transition 0.1 [get_ports {Arr7[9]}]
set_input_transition 0.1 [get_ports {Arr7[8]}]
set_input_transition 0.1 [get_ports {Arr7[7]}]
set_input_transition 0.1 [get_ports {Arr7[6]}]
set_input_transition 0.1 [get_ports {Arr7[5]}]
set_input_transition 0.1 [get_ports {Arr7[4]}]
set_input_transition 0.1 [get_ports {Arr7[3]}]
set_input_transition 0.1 [get_ports {Arr7[2]}]
set_input_transition 0.1 [get_ports {Arr7[1]}]
set_input_transition 0.1 [get_ports {Arr7[0]}]
set_input_transition 0.1 [get_ports {Arr8[15]}]
set_input_transition 0.1 [get_ports {Arr8[14]}]
set_input_transition 0.1 [get_ports {Arr8[13]}]
set_input_transition 0.1 [get_ports {Arr8[12]}]
set_input_transition 0.1 [get_ports {Arr8[11]}]
set_input_transition 0.1 [get_ports {Arr8[10]}]
set_input_transition 0.1 [get_ports {Arr8[9]}]
set_input_transition 0.1 [get_ports {Arr8[8]}]
set_input_transition 0.1 [get_ports {Arr8[7]}]
set_input_transition 0.1 [get_ports {Arr8[6]}]
set_input_transition 0.1 [get_ports {Arr8[5]}]
set_input_transition 0.1 [get_ports {Arr8[4]}]
set_input_transition 0.1 [get_ports {Arr8[3]}]
set_input_transition 0.1 [get_ports {Arr8[2]}]
set_input_transition 0.1 [get_ports {Arr8[1]}]
set_input_transition 0.1 [get_ports {Arr8[0]}]
set_input_transition 0.1 [get_ports {Arr9[15]}]
set_input_transition 0.1 [get_ports {Arr9[14]}]
set_input_transition 0.1 [get_ports {Arr9[13]}]
set_input_transition 0.1 [get_ports {Arr9[12]}]
set_input_transition 0.1 [get_ports {Arr9[11]}]
set_input_transition 0.1 [get_ports {Arr9[10]}]
set_input_transition 0.1 [get_ports {Arr9[9]}]
set_input_transition 0.1 [get_ports {Arr9[8]}]
set_input_transition 0.1 [get_ports {Arr9[7]}]
set_input_transition 0.1 [get_ports {Arr9[6]}]
set_input_transition 0.1 [get_ports {Arr9[5]}]
set_input_transition 0.1 [get_ports {Arr9[4]}]
set_input_transition 0.1 [get_ports {Arr9[3]}]
set_input_transition 0.1 [get_ports {Arr9[2]}]
set_input_transition 0.1 [get_ports {Arr9[1]}]
set_input_transition 0.1 [get_ports {Arr9[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports enable]
set_input_transition 0.1 [get_ports reset]
set_input_delay 0.7 [get_ports {Arr0[15]}]
set_input_delay 0.7 [get_ports {Arr0[14]}]
set_input_delay 0.7 [get_ports {Arr0[13]}]
set_input_delay 0.7 [get_ports {Arr0[12]}]
set_input_delay 0.7 [get_ports {Arr0[11]}]
set_input_delay 0.7 [get_ports {Arr0[10]}]
set_input_delay 0.7 [get_ports {Arr0[9]}]
set_input_delay 0.7 [get_ports {Arr0[8]}]
set_input_delay 0.7 [get_ports {Arr0[7]}]
set_input_delay 0.7 [get_ports {Arr0[6]}]
set_input_delay 0.7 [get_ports {Arr0[5]}]
set_input_delay 0.7 [get_ports {Arr0[4]}]
set_input_delay 0.7 [get_ports {Arr0[3]}]
set_input_delay 0.7 [get_ports {Arr0[2]}]
set_input_delay 0.7 [get_ports {Arr0[1]}]
set_input_delay 0.7 [get_ports {Arr0[0]}]
set_input_delay 0.7 [get_ports {Arr1[15]}]
set_input_delay 0.7 [get_ports {Arr1[14]}]
set_input_delay 0.7 [get_ports {Arr1[13]}]
set_input_delay 0.7 [get_ports {Arr1[12]}]
set_input_delay 0.7 [get_ports {Arr1[11]}]
set_input_delay 0.7 [get_ports {Arr1[10]}]
set_input_delay 0.7 [get_ports {Arr1[9]}]
set_input_delay 0.7 [get_ports {Arr1[8]}]
set_input_delay 0.7 [get_ports {Arr1[7]}]
set_input_delay 0.7 [get_ports {Arr1[6]}]
set_input_delay 0.7 [get_ports {Arr1[5]}]
set_input_delay 0.7 [get_ports {Arr1[4]}]
set_input_delay 0.7 [get_ports {Arr1[3]}]
set_input_delay 0.7 [get_ports {Arr1[2]}]
set_input_delay 0.7 [get_ports {Arr1[1]}]
set_input_delay 0.7 [get_ports {Arr1[0]}]
set_input_delay 0.7 [get_ports {Arr2[15]}]
set_input_delay 0.7 [get_ports {Arr2[14]}]
set_input_delay 0.7 [get_ports {Arr2[13]}]
set_input_delay 0.7 [get_ports {Arr2[12]}]
set_input_delay 0.7 [get_ports {Arr2[11]}]
set_input_delay 0.7 [get_ports {Arr2[10]}]
set_input_delay 0.7 [get_ports {Arr2[9]}]
set_input_delay 0.7 [get_ports {Arr2[8]}]
set_input_delay 0.7 [get_ports {Arr2[7]}]
set_input_delay 0.7 [get_ports {Arr2[6]}]
set_input_delay 0.7 [get_ports {Arr2[5]}]
set_input_delay 0.7 [get_ports {Arr2[4]}]
set_input_delay 0.7 [get_ports {Arr2[3]}]
set_input_delay 0.7 [get_ports {Arr2[2]}]
set_input_delay 0.7 [get_ports {Arr2[1]}]
set_input_delay 0.7 [get_ports {Arr2[0]}]
set_input_delay 0.7 [get_ports {Arr3[15]}]
set_input_delay 0.7 [get_ports {Arr3[14]}]
set_input_delay 0.7 [get_ports {Arr3[13]}]
set_input_delay 0.7 [get_ports {Arr3[12]}]
set_input_delay 0.7 [get_ports {Arr3[11]}]
set_input_delay 0.7 [get_ports {Arr3[10]}]
set_input_delay 0.7 [get_ports {Arr3[9]}]
set_input_delay 0.7 [get_ports {Arr3[8]}]
set_input_delay 0.7 [get_ports {Arr3[7]}]
set_input_delay 0.7 [get_ports {Arr3[6]}]
set_input_delay 0.7 [get_ports {Arr3[5]}]
set_input_delay 0.7 [get_ports {Arr3[4]}]
set_input_delay 0.7 [get_ports {Arr3[3]}]
set_input_delay 0.7 [get_ports {Arr3[2]}]
set_input_delay 0.7 [get_ports {Arr3[1]}]
set_input_delay 0.7 [get_ports {Arr3[0]}]
set_input_delay 0.7 [get_ports {Arr4[15]}]
set_input_delay 0.7 [get_ports {Arr4[14]}]
set_input_delay 0.7 [get_ports {Arr4[13]}]
set_input_delay 0.7 [get_ports {Arr4[12]}]
set_input_delay 0.7 [get_ports {Arr4[11]}]
set_input_delay 0.7 [get_ports {Arr4[10]}]
set_input_delay 0.7 [get_ports {Arr4[9]}]
set_input_delay 0.7 [get_ports {Arr4[8]}]
set_input_delay 0.7 [get_ports {Arr4[7]}]
set_input_delay 0.7 [get_ports {Arr4[6]}]
set_input_delay 0.7 [get_ports {Arr4[5]}]
set_input_delay 0.7 [get_ports {Arr4[4]}]
set_input_delay 0.7 [get_ports {Arr4[3]}]
set_input_delay 0.7 [get_ports {Arr4[2]}]
set_input_delay 0.7 [get_ports {Arr4[1]}]
set_input_delay 0.7 [get_ports {Arr4[0]}]
set_input_delay 0.7 [get_ports {Arr5[15]}]
set_input_delay 0.7 [get_ports {Arr5[14]}]
set_input_delay 0.7 [get_ports {Arr5[13]}]
set_input_delay 0.7 [get_ports {Arr5[12]}]
set_input_delay 0.7 [get_ports {Arr5[11]}]
set_input_delay 0.7 [get_ports {Arr5[10]}]
set_input_delay 0.7 [get_ports {Arr5[9]}]
set_input_delay 0.7 [get_ports {Arr5[8]}]
set_input_delay 0.7 [get_ports {Arr5[7]}]
set_input_delay 0.7 [get_ports {Arr5[6]}]
set_input_delay 0.7 [get_ports {Arr5[5]}]
set_input_delay 0.7 [get_ports {Arr5[4]}]
set_input_delay 0.7 [get_ports {Arr5[3]}]
set_input_delay 0.7 [get_ports {Arr5[2]}]
set_input_delay 0.7 [get_ports {Arr5[1]}]
set_input_delay 0.7 [get_ports {Arr5[0]}]
set_input_delay 0.7 [get_ports {Arr6[15]}]
set_input_delay 0.7 [get_ports {Arr6[14]}]
set_input_delay 0.7 [get_ports {Arr6[13]}]
set_input_delay 0.7 [get_ports {Arr6[12]}]
set_input_delay 0.7 [get_ports {Arr6[11]}]
set_input_delay 0.7 [get_ports {Arr6[10]}]
set_input_delay 0.7 [get_ports {Arr6[9]}]
set_input_delay 0.7 [get_ports {Arr6[8]}]
set_input_delay 0.7 [get_ports {Arr6[7]}]
set_input_delay 0.7 [get_ports {Arr6[6]}]
set_input_delay 0.7 [get_ports {Arr6[5]}]
set_input_delay 0.7 [get_ports {Arr6[4]}]
set_input_delay 0.7 [get_ports {Arr6[3]}]
set_input_delay 0.7 [get_ports {Arr6[2]}]
set_input_delay 0.7 [get_ports {Arr6[1]}]
set_input_delay 0.7 [get_ports {Arr6[0]}]
set_input_delay 0.7 [get_ports {Arr7[15]}]
set_input_delay 0.7 [get_ports {Arr7[14]}]
set_input_delay 0.7 [get_ports {Arr7[13]}]
set_input_delay 0.7 [get_ports {Arr7[12]}]
set_input_delay 0.7 [get_ports {Arr7[11]}]
set_input_delay 0.7 [get_ports {Arr7[10]}]
set_input_delay 0.7 [get_ports {Arr7[9]}]
set_input_delay 0.7 [get_ports {Arr7[8]}]
set_input_delay 0.7 [get_ports {Arr7[7]}]
set_input_delay 0.7 [get_ports {Arr7[6]}]
set_input_delay 0.7 [get_ports {Arr7[5]}]
set_input_delay 0.7 [get_ports {Arr7[4]}]
set_input_delay 0.7 [get_ports {Arr7[3]}]
set_input_delay 0.7 [get_ports {Arr7[2]}]
set_input_delay 0.7 [get_ports {Arr7[1]}]
set_input_delay 0.7 [get_ports {Arr7[0]}]
set_input_delay 0.7 [get_ports {Arr8[15]}]
set_input_delay 0.7 [get_ports {Arr8[14]}]
set_input_delay 0.7 [get_ports {Arr8[13]}]
set_input_delay 0.7 [get_ports {Arr8[12]}]
set_input_delay 0.7 [get_ports {Arr8[11]}]
set_input_delay 0.7 [get_ports {Arr8[10]}]
set_input_delay 0.7 [get_ports {Arr8[9]}]
set_input_delay 0.7 [get_ports {Arr8[8]}]
set_input_delay 0.7 [get_ports {Arr8[7]}]
set_input_delay 0.7 [get_ports {Arr8[6]}]
set_input_delay 0.7 [get_ports {Arr8[5]}]
set_input_delay 0.7 [get_ports {Arr8[4]}]
set_input_delay 0.7 [get_ports {Arr8[3]}]
set_input_delay 0.7 [get_ports {Arr8[2]}]
set_input_delay 0.7 [get_ports {Arr8[1]}]
set_input_delay 0.7 [get_ports {Arr8[0]}]
set_input_delay 0.7 [get_ports {Arr9[15]}]
set_input_delay 0.7 [get_ports {Arr9[14]}]
set_input_delay 0.7 [get_ports {Arr9[13]}]
set_input_delay 0.7 [get_ports {Arr9[12]}]
set_input_delay 0.7 [get_ports {Arr9[11]}]
set_input_delay 0.7 [get_ports {Arr9[10]}]
set_input_delay 0.7 [get_ports {Arr9[9]}]
set_input_delay 0.7 [get_ports {Arr9[8]}]
set_input_delay 0.7 [get_ports {Arr9[7]}]
set_input_delay 0.7 [get_ports {Arr9[6]}]
set_input_delay 0.7 [get_ports {Arr9[5]}]
set_input_delay 0.7 [get_ports {Arr9[4]}]
set_input_delay 0.7 [get_ports {Arr9[3]}]
set_input_delay 0.7 [get_ports {Arr9[2]}]
set_input_delay 0.7 [get_ports {Arr9[1]}]
set_input_delay 0.7 [get_ports {Arr9[0]}]
set_input_delay 0.7 [get_ports clk]
set_input_delay 0.7 [get_ports enable]
set_input_delay 0.7 [get_ports reset]
set_output_delay 18 -clock vsysclk [get_ports done]
set_output_delay 18 -clock vsysclk [get_ports {result[3]}]
set_output_delay 18 -clock vsysclk [get_ports {result[2]}]
set_output_delay 18 -clock vsysclk [get_ports {result[1]}]
set_output_delay 18 -clock vsysclk [get_ports {result[0]}]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
