#
# Created by 
#   ../bin/Linux-x86_64-O/oasysGui 19.2-p002 on Wed May  5 19:01:24 2021
# (C) Mentor Graphics Corporation
#
set_units -time ns -capacitance ff -resistance kohm -power nW -voltage V -current mA
create_clock -period 60 -waveform {0 30} -name vsysclk 
group_path -name I2R -from [list [get_ports reset] [get_ports enable] [get_ports clk] [get_ports {R[0]}] [get_ports {R[1]}] [get_ports {R[2]}] [get_ports {R[3]}] [get_ports {R[4]}] [get_ports {R[5]}] [get_ports {R[6]}] [get_ports {R[7]}] [get_ports {R[8]}] [get_ports {R[9]}] [get_ports {R[10]}] [get_ports {R[11]}] [get_ports {R[12]}] [get_ports {R[13]}] [get_ports {R[14]}] [get_ports {R[15]}] [get_ports {M[0]}] [get_ports {M[1]}] [get_ports {M[2]}] [get_ports {M[3]}] [get_ports {M[4]}] [get_ports {M[5]}] [get_ports {M[6]}] [get_ports {M[7]}] [get_ports {M[8]}] [get_ports {M[9]}] [get_ports {M[10]}] [get_ports {M[11]}] [get_ports {M[12]}] [get_ports {M[13]}] [get_ports {M[14]}] [get_ports {M[15]}]]
group_path -name I2O -from [list [get_ports reset] [get_ports enable] [get_ports clk] [get_ports {R[0]}] [get_ports {R[1]}] [get_ports {R[2]}] [get_ports {R[3]}] [get_ports {R[4]}] [get_ports {R[5]}] [get_ports {R[6]}] [get_ports {R[7]}] [get_ports {R[8]}] [get_ports {R[9]}] [get_ports {R[10]}] [get_ports {R[11]}] [get_ports {R[12]}] [get_ports {R[13]}] [get_ports {R[14]}] [get_ports {R[15]}] [get_ports {M[0]}] [get_ports {M[1]}] [get_ports {M[2]}] [get_ports {M[3]}] [get_ports {M[4]}] [get_ports {M[5]}] [get_ports {M[6]}] [get_ports {M[7]}] [get_ports {M[8]}] [get_ports {M[9]}] [get_ports {M[10]}] [get_ports {M[11]}] [get_ports {M[12]}] [get_ports {M[13]}] [get_ports {M[14]}] [get_ports {M[15]}]]  -to [list [get_ports finish] [get_ports {fixedMulResult[0]}] [get_ports {fixedMulResult[1]}] [get_ports {fixedMulResult[2]}] [get_ports {fixedMulResult[3]}] [get_ports {fixedMulResult[4]}] [get_ports {fixedMulResult[5]}] [get_ports {fixedMulResult[6]}] [get_ports {fixedMulResult[7]}] [get_ports {fixedMulResult[8]}] [get_ports {fixedMulResult[9]}] [get_ports {fixedMulResult[10]}] [get_ports {fixedMulResult[11]}] [get_ports {fixedMulResult[12]}] [get_ports {fixedMulResult[13]}] [get_ports {fixedMulResult[14]}] [get_ports {fixedMulResult[15]}]]
group_path -name R2O -to [list [get_ports finish] [get_ports {fixedMulResult[0]}] [get_ports {fixedMulResult[1]}] [get_ports {fixedMulResult[2]}] [get_ports {fixedMulResult[3]}] [get_ports {fixedMulResult[4]}] [get_ports {fixedMulResult[5]}] [get_ports {fixedMulResult[6]}] [get_ports {fixedMulResult[7]}] [get_ports {fixedMulResult[8]}] [get_ports {fixedMulResult[9]}] [get_ports {fixedMulResult[10]}] [get_ports {fixedMulResult[11]}] [get_ports {fixedMulResult[12]}] [get_ports {fixedMulResult[13]}] [get_ports {fixedMulResult[14]}] [get_ports {fixedMulResult[15]}]]
set_load 10 [get_ports {fixedMulResult[15]}]
set_load 10 [get_ports {fixedMulResult[14]}]
set_load 10 [get_ports {fixedMulResult[13]}]
set_load 10 [get_ports {fixedMulResult[12]}]
set_load 10 [get_ports {fixedMulResult[11]}]
set_load 10 [get_ports {fixedMulResult[10]}]
set_load 10 [get_ports {fixedMulResult[9]}]
set_load 10 [get_ports {fixedMulResult[8]}]
set_load 10 [get_ports {fixedMulResult[7]}]
set_load 10 [get_ports {fixedMulResult[6]}]
set_load 10 [get_ports {fixedMulResult[5]}]
set_load 10 [get_ports {fixedMulResult[4]}]
set_load 10 [get_ports {fixedMulResult[3]}]
set_load 10 [get_ports {fixedMulResult[2]}]
set_load 10 [get_ports {fixedMulResult[1]}]
set_load 10 [get_ports {fixedMulResult[0]}]
set_load 10 [get_ports finish]
set_input_transition 0.1 [get_ports {M[15]}]
set_input_transition 0.1 [get_ports {M[14]}]
set_input_transition 0.1 [get_ports {M[13]}]
set_input_transition 0.1 [get_ports {M[12]}]
set_input_transition 0.1 [get_ports {M[11]}]
set_input_transition 0.1 [get_ports {M[10]}]
set_input_transition 0.1 [get_ports {M[9]}]
set_input_transition 0.1 [get_ports {M[8]}]
set_input_transition 0.1 [get_ports {M[7]}]
set_input_transition 0.1 [get_ports {M[6]}]
set_input_transition 0.1 [get_ports {M[5]}]
set_input_transition 0.1 [get_ports {M[4]}]
set_input_transition 0.1 [get_ports {M[3]}]
set_input_transition 0.1 [get_ports {M[2]}]
set_input_transition 0.1 [get_ports {M[1]}]
set_input_transition 0.1 [get_ports {M[0]}]
set_input_transition 0.1 [get_ports {R[15]}]
set_input_transition 0.1 [get_ports {R[14]}]
set_input_transition 0.1 [get_ports {R[13]}]
set_input_transition 0.1 [get_ports {R[12]}]
set_input_transition 0.1 [get_ports {R[11]}]
set_input_transition 0.1 [get_ports {R[10]}]
set_input_transition 0.1 [get_ports {R[9]}]
set_input_transition 0.1 [get_ports {R[8]}]
set_input_transition 0.1 [get_ports {R[7]}]
set_input_transition 0.1 [get_ports {R[6]}]
set_input_transition 0.1 [get_ports {R[5]}]
set_input_transition 0.1 [get_ports {R[4]}]
set_input_transition 0.1 [get_ports {R[3]}]
set_input_transition 0.1 [get_ports {R[2]}]
set_input_transition 0.1 [get_ports {R[1]}]
set_input_transition 0.1 [get_ports {R[0]}]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports enable]
set_input_transition 0.1 [get_ports reset]
set_input_delay 0.7 [get_ports {M[15]}]
set_input_delay 0.7 [get_ports {M[14]}]
set_input_delay 0.7 [get_ports {M[13]}]
set_input_delay 0.7 [get_ports {M[12]}]
set_input_delay 0.7 [get_ports {M[11]}]
set_input_delay 0.7 [get_ports {M[10]}]
set_input_delay 0.7 [get_ports {M[9]}]
set_input_delay 0.7 [get_ports {M[8]}]
set_input_delay 0.7 [get_ports {M[7]}]
set_input_delay 0.7 [get_ports {M[6]}]
set_input_delay 0.7 [get_ports {M[5]}]
set_input_delay 0.7 [get_ports {M[4]}]
set_input_delay 0.7 [get_ports {M[3]}]
set_input_delay 0.7 [get_ports {M[2]}]
set_input_delay 0.7 [get_ports {M[1]}]
set_input_delay 0.7 [get_ports {M[0]}]
set_input_delay 0.7 [get_ports {R[15]}]
set_input_delay 0.7 [get_ports {R[14]}]
set_input_delay 0.7 [get_ports {R[13]}]
set_input_delay 0.7 [get_ports {R[12]}]
set_input_delay 0.7 [get_ports {R[11]}]
set_input_delay 0.7 [get_ports {R[10]}]
set_input_delay 0.7 [get_ports {R[9]}]
set_input_delay 0.7 [get_ports {R[8]}]
set_input_delay 0.7 [get_ports {R[7]}]
set_input_delay 0.7 [get_ports {R[6]}]
set_input_delay 0.7 [get_ports {R[5]}]
set_input_delay 0.7 [get_ports {R[4]}]
set_input_delay 0.7 [get_ports {R[3]}]
set_input_delay 0.7 [get_ports {R[2]}]
set_input_delay 0.7 [get_ports {R[1]}]
set_input_delay 0.7 [get_ports {R[0]}]
set_input_delay 0.7 [get_ports clk]
set_input_delay 0.7 [get_ports enable]
set_input_delay 0.7 [get_ports reset]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[15]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[14]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[13]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[12]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[11]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[10]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[9]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[8]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[7]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[6]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[5]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[4]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[3]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[2]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[1]}]
set_output_delay 18 -clock vsysclk [get_ports {fixedMulResult[0]}]
set_output_delay 18 -clock vsysclk [get_ports finish]
set_operating_conditions  -library  [get_libs {NangateOpenCellLibrary}] -max  typical
